In [1]:
%pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\kerenb\appdata\local\programs\python\python314\lib\site-packages (9.5.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import mysql.connector

In [3]:
import pandas as pd

In [5]:

db = mysql.connector.connect(
        host="localhost",
        user="root",
        password="5172661050!Kb",
        database="hrdb",
        use_pure=True
    )

mycursor = db.cursor()
print("Connection successful")

Connection successful

In [18]:
# Write your SQL query
query = "SELECT * FROM table2"  # Replace 'your_table_name' with your actual table name
    
mycursor.execute(query)  # Execute query 
result = mycursor.fetchall()

# Get column names from the cursor
column_names = [i[0] for i in mycursor.description]

# Create a DataFrame from the result
hrtable2 = pd.DataFrame(result, columns=column_names)



    
# Print the DataFrame
#df

In [19]:
hrtable2

,EmployeeNumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,1,2,Female,94,3,2,Sales Executive,4,Single,5993,...,1,80,0,8,0,1,6,4,0,5
1,2,3,Male,61,2,2,Research Scientist,2,Married,5130,...,4,80,1,10,3,3,10,7,1,7
2,4,4,Male,92,2,1,Laboratory Technician,3,Single,2090,...,2,80,0,7,3,3,0,0,0,0
3,5,4,Female,56,3,1,Research Scientist,3,Married,2909,...,3,80,0,8,3,3,8,7,3,0
4,7,1,Male,40,3,1,Laboratory Technician,2,Married,3468,...,4,80,1,6,3,3,2,2,2,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1465,2061,3,Male,41,4,2,Laboratory Technician,4,Married,2571,...,3,80,1,17,3,3,5,2,0,3
1466,2062,4,Male,42,2,3,Healthcare Representative,1,Married,9991,...,1,80,1,9,5,3,7,7,1,7
1467,2064,2,Male,87,4,2,Manufacturing Director,2,Married,6142,...,2,80,1,6,0,3,6,2,0,3
1468,2065,4,Male,63,2,2,Sales Executive,2,Married,5390,...,4,80,0,17,3,2,9,6,0,8
1469,2068,2,Male,82,4,2,Laboratory Technician,3,Married,4404,...,1,80,0,6,3,4,4,3,1,2

In [ ]:
def sql_script(query):
    mycursor.execute(query)
    result = mycursor.fetchall()
    column_names = [i[0] for i in mycursor.description]
    df = pd.DataFrame(result, columns=column_names)

    return df

In [ ]:
def sql_script(query):
    mycursor.execute(query)
    result = mycursor.fetchall()
    column_names = [i[0] for i in mycursor.description]
    df = pd.DataFrame(result, columns=column_names)

    return df

In [21]:
sql_script("Select * from table1")

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7
...,...,...,...,...,...,...,...,...,...,...
1465,36,No,Travel_Frequently,884,Research & Development,23,2,Medical,1,2061
1466,39,No,Travel_Rarely,613,Research & Development,6,1,Medical,1,2062
1467,27,No,Travel_Rarely,155,Research & Development,4,3,Life Sciences,1,2064
1468,49,No,Travel_Frequently,1023,Sales,2,3,Medical,1,2065
1469,34,No,Travel_Rarely,628,Research & Development,8,3,Medical,1,2068

In [29]:
joined_table=sql_script("""SELECT *
FROM table2
INNER JOIN table1
ON table1.EmployeeNumber = table2.EmployeeNumber;""")

In [30]:
joined_table

,EmployeeNumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,...,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber
0,1,2,Female,94,3,2,Sales Executive,4,Single,5993,...,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1
1,2,3,Male,61,2,2,Research Scientist,2,Married,5130,...,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2
2,4,4,Male,92,2,1,Laboratory Technician,3,Single,2090,...,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4
3,5,4,Female,56,3,1,Research Scientist,3,Married,2909,...,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5
4,7,1,Male,40,3,1,Laboratory Technician,2,Married,3468,...,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1465,2061,3,Male,41,4,2,Laboratory Technician,4,Married,2571,...,36,No,Travel_Frequently,884,Research & Development,23,2,Medical,1,2061
1466,2062,4,Male,42,2,3,Healthcare Representative,1,Married,9991,...,39,No,Travel_Rarely,613,Research & Development,6,1,Medical,1,2062
1467,2064,2,Male,87,4,2,Manufacturing Director,2,Married,6142,...,27,No,Travel_Rarely,155,Research & Development,4,3,Life Sciences,1,2064
1468,2065,4,Male,63,2,2,Sales Executive,2,Married,5390,...,49,No,Travel_Frequently,1023,Sales,2,3,Medical,1,2065
1469,2068,2,Male,82,4,2,Laboratory Technician,3,Married,4404,...,34,No,Travel_Rarely,628,Research & Development,8,3,Medical,1,2068

In [22]:
mycursor.description

[('Age', 3, None, None, None, None, 1, 0, 63),
 ('Attrition', 252, None, None, None, None, 1, 16, 255),
 ('BusinessTravel', 252, None, None, None, None, 1, 16, 255),
 ('DailyRate', 3, None, None, None, None, 1, 0, 63),
 ('Department', 252, None, None, None, None, 1, 16, 255),
 ('DistanceFromHome', 3, None, None, None, None, 1, 0, 63),
 ('Education', 3, None, None, None, None, 1, 0, 63),
 ('EducationField', 252, None, None, None, None, 1, 16, 255),
 ('EmployeeCount', 3, None, None, None, None, 1, 0, 63),
 ('EmployeeNumber', 3, None, None, None, None, 1, 0, 63)]

EDA 
# Identify missing values and handle them appropriately.
# Perform summary statistics and visualize data distributions.